CSI API ETABS v1
cPropLineSpring.GetLineSpringProp Method
 Retrieves an existing named line spring property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLineSpringProp(
	string Name,
	ref double U1,
	ref double U2,
	ref double U3,
	ref double R1,
	ref int NonlinearOption2,
	ref int NonlinearOption3,
	ref int color,
	ref string notes,
	ref string iGUID
)
Function GetLineSpringProp (
	Name As String,
	ByRef U1 As Double,
	ByRef U2 As Double,
	ByRef U3 As Double,
	ByRef R1 As Double,
	ByRef NonlinearOption2 As Integer,
	ByRef NonlinearOption3 As Integer,
	ByRef color As Integer,
	ByRef notes As String,
	ByRef iGUID As String
) As Integer
Dim instance As cPropLineSpring
Dim Name As String
Dim U1 As Double
Dim U2 As Double
Dim U3 As Double
Dim R1 As Double
Dim NonlinearOption2 As Integer
Dim NonlinearOption3 As Integer
Dim color As Integer
Dim notes As String
Dim iGUID As String
Dim returnValue As Integer
returnValue = instance.GetLineSpringProp(Name,
	U1, U2, U3, R1, NonlinearOption2, NonlinearOption3,
	color, notes, iGUID)
int GetLineSpringProp(
	String^ Name,
	double% U1,
	double% U2,
	double% U3,
	double% R1,
	int% NonlinearOption2,
	int% NonlinearOption3,
	int% color,
	String^% notes,
	String^% iGUID
)
abstract GetLineSpringProp :
        Name : string *
        U1 : float byref *
        U2 : float byref *
        U3 : float byref *
        R1 : float byref *
        NonlinearOption2 : int byref *
        NonlinearOption3 : int byref *
        color : int byref *
        notes : string byref *
        iGUID : string byref -> int
Parameters
Name
Type: System.String
 The name of the line spring property.
U1
Type: System.Double
 The spring stiffness per unit length in the local 1 direction [F/L2]
U2
Type: System.Double
 The spring stiffness per unit length in the local 2 direction [F/L2]
U3
Type: System.Double
 The spring stiffness per unit length in the local 3 direction [F/L2]
R1
Type: System.Double
 The rotational spring stiffness about local 1 [F/rad]
NonlinearOption2
Type: System.Int32
 The nonlinear option for the local 2 direction, this is one of the following values:
0 = (None) Linear - Resists Tension and Compression
1 = Resists Compression only
2 = Resists Tension only
NonlinearOption3
Type: System.Int32
 The nonlinear option for the local 3 direction, this is one of the following values:
0 = (None) Linear - Resists Tension and Compression
1 = Resists Compression only
2 = Resists Tension only
color
Type: System.Int32
 The display color for the property specified as an integer
notes
Type: System.String
 The notes, if any, assigned to the property
iGUID
Type: System.String
 The GUID (global unique identifier), if any, assigned to the property
Return Value
Type: Int32
 Returns zero if the property is successfully set, otherwise returns nonzero
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new spring property
    ret = SapModel.PropLineSpring.SetLineSpringProp("mySpringProp1", 0, 10, 20, 0, 0, 1)
'get property
   Dim U1 As Double
   Dim U2 As Double
   Dim U3 As Double
   Dim R1 As Double
   Dim NonlinearOption2 As Integer
   Dim NonlinearOption3 As Integer
   Dim color As Integer
   Dim notes As String
   Dim iGuid As String
   ret = SapModel.PropLineSpring.GetLineSpringProp("mySpringProp1", U1, U2, U3, R1, NonlinearOption2, NonlinearOption3, color, notes, iGuid)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPropLineSpring Interface
ETABSv1 Namespace